Cesium-1.44/52N_InnovationChallenge/SOS Service/insertObservations.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
    <env:Body>
        <sos:InsertObservation
            xmlns:sos="http://www.opengis.net/sos/2.0"
            xmlns:swes="http://www.opengis.net/swes/2.0"
            xmlns:swe="http://www.opengis.net/swe/2.0"
            xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
            xmlns:gml="http://www.opengis.net/gml/3.2"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            xmlns:om="http://www.opengis.net/om/2.0"
            xmlns:sams="http://www.opengis.net/samplingSpatial/2.0"
            xmlns:sf="http://www.opengis.net/sampling/2.0" service="SOS" version="2.0.0" xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd            http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd">
            <!-- multiple offerings are possible -->
            <sos:offering>123</sos:offering>
            <sos:observation>
                <om:OM_Observation gml:id="o1">
                    <gml:description>Test for insert observations</gml:description>
                    <gml:identifier codeSpace="">http://www.52north.org/test/observation/9</gml:identifier>
                    <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement"/>
                    <om:phenomenonTime>
                        <gml:TimeInstant gml:id="phenomenonTime">
                            <gml:timePosition>2018-08-14T16:57:15.000+08:00</gml:timePosition>
                        </gml:TimeInstant>
                    </om:phenomenonTime>
                    <om:resultTime xlink:href="#phenomenonTime"/>
                    <om:procedure xlink:href="test1"/>
                    <om:observedProperty xlink:href="http://www.52north.org/test/observableProperty/9_3"/>
                    <om:featureOfInterest>
                        <sams:SF_SpatialSamplingFeature gml:id="123">
                            <gml:identifier codeSpace="">test 1 Observations</gml:identifier>
                            <gml:name>52°North</gml:name>
                            <sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/>
                            <sf:sampledFeature xlink:href="http://www.52north.org/test/featureOfInterest/1"/>
                            <sams:shape>
                                <gml:Point gml:id="Point1">
                                    <gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">121.1873515 24.9679737</gml:pos>
                                </gml:Point>
                            </sams:shape>
                        </sams:SF_SpatialSamplingFeature>
                    </om:featureOfInterest>
                    <om:result xsi:type="gml:MeasureType" uom="degree">30</om:result>
                </om:OM_Observation>
            </sos:observation>
        </sos:InsertObservation>
    </env:Body>
</env:Envelope>